#Вывести на экран числа от -N до N
print('Введите число')
n=int(input())
for n in range(-n,n+1):
    print(n)